In [35]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame({'x': [1,2,3,4,5], 'y': [9,8,7,6,5]})
df2 = pd.DataFrame([{'x': 1, 'y': 9},{'x': 2, 'y': 8},{'x': 3, 'y': 7},{'x': 4, 'y': 6},{'x': 5, 'y': 5}])

In [6]:
df1

   x  y
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [7]:
df2

   x  y
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [9]:
len(df1.index)

5

In [10]:
df1.columns

Index(['x', 'y'], dtype='object')

In [11]:
df1.head(2)

   x  y
0  1  9
1  2  8

In [13]:
df1.tail(3)

   x  y
2  3  7
3  4  6
4  5  5

In [14]:
df1['x']

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [15]:
df1['y']

0    9
1    8
2    7
3    6
4    5
Name: y, dtype: int64

In [17]:
df1['x'].loc[0]

1

In [18]:
df1['x'].iloc[0]

1

In [25]:
# Use this one
df1[df1['x'] > 2]['x']

2    3
3    4
4    5
Name: x, dtype: int64

In [21]:
# Not this one
df1['x'][df1['x'] > 2]

2    3
3    4
4    5
Name: x, dtype: int64

In [26]:
df1.to_csv('example_data.csv')

In [27]:
df3 = df1

In [37]:
df3['y'] = [34,45,np.nan,67,""]

In [39]:
df3['z'] = df3['y']
df3

   x    y    z
0  1   34   34
1  2   45   45
2  3  NaN  NaN
3  4   67   67
4  5

In [40]:
df3.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False   True   True
3  False  False  False
4  False  False  False

In [43]:
df3.iloc[1]

x     2
y    45
z    45
Name: 1, dtype: object

In [44]:
df3['k'] = [x/2 for x in df3['x']]

In [46]:
df3

   x    y    z    k
0  1   34   34  0.5
1  2   45   45  1.0
2  3  NaN  NaN  1.5
3  4   67   67  2.0
4  5            2.5

In [ ]:
k = []
for i in df3.index:
    k[i] = df3['x'][i]/2

In [49]:
for i in df3['y']:
    print(i)

34
45
nan
67

In [ ]:
for (let x = 0, x < length(index), x++)

In [53]:
for i in range(0, len(df3['x'].index) - 3):
    print(i)

0
1